tests/fixtures/export/m-seq.mmd
---
title: "Greeting"
---
sequenceDiagram
  participant Alice
  participant Bob
  participant C
  Alice->>Bob: Hello
  loop Every minute
    Bob-->>Alice: Fine
  end
  alt sick
    opt really
      Bob-)Alice: cough
    end
  else well
    Bob->>C: great
  end
  C->>C: self
