tests/fixtures/export/m-seq.puml
@startuml
title Greeting
participant "Alice" as P0
participant "Bob" as P1
participant "C" as P2
P0 -> P1 : Hello
loop Every minute
P1 --> P0 : Fine
end
alt sick
opt really
P1 ->> P0 : cough
end
else well
P1 -> P2 : great
end
P2 -> P2 : self
@enduml
